definetly not fixing.

```
➜  test git:(feat/init) ✗ terraform apply --auto-approve  
data.ibm_iam_account_settings.iam_account_settings: Reading...
data.ibm_iam_account_settings.iam_account_settings: Read complete after 0s [id=3f2cae45b0644f6d87aefcf404f5987f]
data.ibm_cloud_shell_account_settings.cloud_shell_account_settings: Reading...
data.ibm_cloud_shell_account_settings.cloud_shell_account_settings: Read complete after 2s

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_cloud_shell_account_settings.cloud_shell_account_settings will be created
  + resource "ibm_cloud_shell_account_settings" "cloud_shell_account_settings" {
      + account_id = "3f2cae45b0644f6d87aefcf404f5987f"
      + created_at = (known after apply)
      + created_by = (known after apply)
      + enabled    = false
      + id         = (known after apply)
      + rev        = (known after apply)
      + type       = (known after apply)
      + updated_at = (known after apply)
      + updated_by = (known after apply)

      + features {
          + enabled = (known after apply)
          + key     = (known after apply)
        }

      + regions {
          + enabled = (known after apply)
          + key     = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
ibm_cloud_shell_account_settings.cloud_shell_account_settings: Creating...
╷
│ Error: Plugin did not respond
│ 
│   with ibm_cloud_shell_account_settings.cloud_shell_account_settings,
│   on main.tf line 9, in resource "ibm_cloud_shell_account_settings" "cloud_shell_account_settings":
│    9: resource "ibm_cloud_shell_account_settings" "cloud_shell_account_settings" {
│ 
│ The plugin encountered an error, and failed to respond to the plugin.(*GRPCProvider).ApplyResourceChange call. The plugin logs may contain more details.
╵

Stack trace from the terraform-provider-ibm_v1.65.1 plugin:

panic: runtime error: invalid memory address or nil pointer dereference
[signal SIGSEGV: segmentation violation code=0x2 addr=0x0 pc=0x1024ff1e8]

goroutine 119 [running]:
github.com/IBM-Cloud/terraform-provider-ibm/ibm/service/cloudshell.resourceIBMCloudShellAccountSettingsCreate({0x10528d078, 0x1400299d260}, 0x1072c4d20?, {0x105233560?, 0x14000a60a80})
        github.com/IBM-Cloud/terraform-provider-ibm/ibm/service/cloudshell/resource_ibm_cloud_shell_account_settings.go:172 +0x5e8
github.com/IBM-Cloud/terraform-provider-ibm/ibm/provider.wrapFunction.func1({0x10528d078?, 0x1400299d260?}, 0x0?, {0x105233560?, 0x14000a60a80?})
        github.com/IBM-Cloud/terraform-provider-ibm/ibm/provider/provider.go:1533 +0x34
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0x140015a2e00, {0x10528d0b0, 0x140029c95f0}, 0xd?, {0x105233560, 0x14000a60a80})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.29.0/helper/schema/resource.go:778 +0xe8
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0x140015a2e00, {0x10528d0b0, 0x140029c95f0}, 0x140029bd860, 0x14001bebc00, {0x105233560, 0x14000a60a80})
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.29.0/helper/schema/resource.go:909 +0x890
github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*GRPCProviderServer).ApplyResourceChange(0x140011b1458, {0x10528d0b0?, 0x140029c94d0?}, 0x14001be5bd0)
        github.com/hashicorp/terraform-plugin-sdk/v2@v2.29.0/helper/schema/grpc_provider.go:1060 +0xb70
github.com/hashicorp/terraform-plugin-go/tfprotov5/tf5server.(*server).ApplyResourceChange(0x14000ade640, {0x10528d0b0?, 0x140029c8ae0?}, 0x1400298d650)
        github.com/hashicorp/terraform-plugin-go@v0.19.0/tfprotov5/tf5server/server.go:859 +0x3b8
github.com/hashicorp/terraform-plugin-go/tfprotov5/internal/tfplugin5._Provider_ApplyResourceChange_Handler({0x1050ac800?, 0x14000ade640}, {0x10528d0b0, 0x140029c8ae0}, 0x1400298d5e0, 0x0)
        github.com/hashicorp/terraform-plugin-go@v0.19.0/tfprotov5/internal/tfplugin5/tfplugin5_grpc.pb.go:467 +0x170
google.golang.org/grpc.(*Server).processUnaryRPC(0x140001c0000, {0x105297e20, 0x1400021a680}, 0x140029c5200, 0x140015696e0, 0x107283d98, 0x0)
        google.golang.org/grpc@v1.57.1/server.go:1358 +0xc88
google.golang.org/grpc.(*Server).handleStream(0x140001c0000, {0x105297e20, 0x1400021a680}, 0x140029c5200, 0x0)
        google.golang.org/grpc@v1.57.1/server.go:1735 +0x82c
google.golang.org/grpc.(*Server).serveStreams.func1.1()
        google.golang.org/grpc@v1.57.1/server.go:970 +0xb4
created by google.golang.org/grpc.(*Server).serveStreams.func1
        google.golang.org/grpc@v1.57.1/server.go:981 +0x174

Error: The terraform-provider-ibm_v1.65.1 plugin crashed!

This is always indicative of a bug within the plugin. It would be immensely
helpful if you could report the crash with the plugin's maintainers so that it
can be fixed. The output above should help diagnose the issue.
```